WELCOME_CHAT_NAME = "Знакомство с AI-Chat"
WELCOME_CHAT_MESSAGE = \
"""
# Добро пожаловать в CeRBeR-AI! 🤖

Привет! Я ваш интеллектуальный помощник, и я здесь, чтобы помочь вам. Ознакомьтесь с моими возможностями:

## 🌟 Функционал CeRBeR-AI

- **Различные популярные AI модели**: Используйте лучшие модели искусственного интеллекта для решения ваших задач и получения качественных ответов.

- **До 100 сообщений в день**: Обменивайтесь сообщениями с ботом до 100 раз в день. В зависимости от вашего тарифа, длина сообщений может достигать до 20,000 символов!

- **Возможность отслеживать статистику**: Следите за своей активностью и взаимодействиями с ботом, чтобы оптимизировать использование функционала.

- **Голосовой ввод сообщений**: Общайтесь через голосовой ввод! Просто говорите, и ваш текст будет преобразован в сообщение.

- **Добавление текстовых файлов в сообщение**: Удобно делитесь текстовыми файлами, чтобы получать помощь по документам или другим материалам!

- **Возможность копирования кода и сообщений**: Легко копируйте код и текст ваших сообщений для дальнейшего использования.

- **Поддержка Markdown, LaTeX и Mermaid**: Оформляйте ваши сообщения с помощью Markdown для форматирования, используйте LaTeX для математических формул и Mermaid для создания блок-схем.

- **Поддержка тёмной темы**: Переключайтесь на тёмную тему для более комфортного чтения в условиях низкой освещенности.

- **Полная защита ваших данных**: Ваши данные и конфиденциальность находятся под надежной защитой, чтобы вы могли общаться без забот.

---

Если у вас есть вопросы, просто напишите, и я помогу вам!
"""

LETTER_REGISTRATION_TITLE = "Регистрация в CeRBeR-AI"
LETTER_CONFIRMATION_MESSAGE = "Ваш код подтверждения: {code}\n\nЭто сообщение отправлено автоматически."
LETTER_PASSWORD_RESET_TITLE = "Подтверждения сброса пароля"
LETTER_FEEDBACK_TITLE = "Обратная связь от {name}"
LETTER_FEEDBACK_MESSAGE = "Пользователь {from_email} оставил обратную связь:\n\n{message}"
